using Alrazi.Enums.Test;
using Alrazi.Models;
using Alrazi.Models.Test;
using Alrazi.Services;
using Alrazi.Tools;
using Alrazi.ViewModel;
using Microsoft.AspNetCore.Mvc;

namespace Alrazi.Controllers
{
    public class TestController : Controller
    {
        private readonly TestService testService;
        private readonly StudentService studentService;

        public TestController(TestService testService, StudentService studentService)
        {
            this.testService = testService;
            this.studentService = studentService;
        }

        //عرض الإختبارات المتاحة للطالب
        public async Task<IActionResult> ShowTest(int studentId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            Student student = await testService.GetLastTestPortage(studentId);
            return View(student);
        }
        //إضافة اختبار للطالب ويتم من خلالها التوجيه لإضافة الاختبار
        public IActionResult AddTest(int studentId, TestType testType)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            return testType switch
            {
                TestType.Portage => RedirectToAction("AddTestPortage", new { studentId = studentId }),
                TestType.StanfordBinet => RedirectToAction("AddTestStanfordBinet", new { studentId = studentId }),
                TestType.PortageSkill => RedirectToAction("AddTestPortageSkill", new { studentId = studentId }),
                _ => RedirectToAction("Index", "Home"),
            };
        }
        //جلب جميع اختبارات الطالب لاختبار محدد
        public IActionResult GetTest(int studentId, TestType testType)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            return testType switch
            {
                TestType.Portage => RedirectToAction("GetTestPortage", new { studentId = studentId }),
                TestType.StanfordBinet => RedirectToAction("GetTestStanfordBinet", new { studentId = studentId }),
                TestType.PortageSkill => RedirectToAction("GetTestPortageSkill", new { studentId = studentId }),
                _ => RedirectToAction("Index", "Home"),
            };
        }




        #region Portage

        public async Task<IActionResult> AddTestPortage(int studentId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            Student student = await studentService.GetStudent(studentId);

            return View(student);
        }

        [HttpPost]
        public async Task<IActionResult> AddTestPortage(TestPortage testPortage)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            int testId = await testService.AddTestPortage(testPortage);
            return RedirectToAction("GetTestPortgeReport", new { testId = testId });
        }

        public async Task<IActionResult> AddTestPortageSkill(int studentId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            Student testPortages = await testService.GetLastTestPortage(studentId);
            ViewBag.selectedTestId = testPortages.TestPortages.Any() ? testPortages.TestPortages[0].Id : 0;
            return View(testPortages);
        }

        [HttpPost]
        public async Task<IActionResult> AddTestPortageSkill(TestPortage testPortage)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            int stdId = await testService.AddTestPortageSkill(testPortage);
            ViewBag.selectedTestId = testPortage.Id;
            return RedirectToAction("GetTestPortageSkill", new { studentId = stdId });
        }

        //طباعة تقرير الاختبار الواحد
        public async Task<IActionResult> GetTestPortgeReport(int testId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            TestPortage getTest = await testService.GetTestPortageById(testId);
            return View(getTest);
        }
        [HttpPost]
        public async Task<IActionResult> GetTestPortgeReport(TestPortage testPortage)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            TestPortage getTest = await testService.UpdateSummaryTestPortage(testPortage);
            return View(getTest);
        }

        public async Task<IActionResult> GetTestPortage(int studentId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            List<TestPortageDetails> getTest = await testService.GetStudentTestPortage(studentId);
            return View(getTest);
        }
        public async Task<IActionResult> GetTestPortageSkill(int studentId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            List<TestPortage> getTest = await testService.GetStudentTestPortageSkill(studentId);
            return View(getTest);
        }
        public IActionResult GetTestPortageIndividualPlan()
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            List<TestPortageIndividualPlanVM> testPortageIndividualPlanVMs = new();

            TestPortageIndividualPlanVM testPortageIndividualPlanVM = new();

            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد الاجتماعي الانفعالي (التفاعل مع الآخرين)",
                Quastions = [
             "ينظر لشخص يحاول أن يشد انتباهه بالحديث إليه أو الحركة أمامه",
             "يبتسم، أو يصدر أصوات أو يكف عن البكاء استجابة لوجوده في محيط العائلة.",
             "يربت ويشد على ملامح وجه شخص كبير(الشعر، الأنف ، النظارات..الخ)",
             "يتواصل بصرياً لمدة من 2 - 3 دقائق عندما يكون برعاية شخص",
             "يلعب لعبة الاستغماية باليد(أوبي ، دي عيني ، بيكابو) مقلداً",
             "يصفق باليدين مقلداً الكبار",
             "يقول باي، باي بيده مقلدا الكبار",
             "يحضن، ويربت يقبل أشخاص مألوفين",
             "يتجاوب عند سماع اسمه الشخصي بالنظر أو مد الذراعين كي يحمل",
             "يمد اللعب أو الأشياء إلى الكبير ويطلق سراحها",
             "يشارك بأشياء أو طعام مع الآخرين عندما يطلب منه",
             "يحيي أطفال بعمره ومكانته والكبار المألوفين عندما يذكر",
             "يحضر أو يأخذ شيء من غرفة إلى أخرى عندما يعطى التعليمات",
             "يظهر محاولة لمساعدة والدته أو والده بمهامهما وذلك بعمل جزء من الشغل: حمل الغسيل ، نقل المكنسة ... إلخ",
             "يحيي الكبار المألوفين لديه بدون تذكير",
             "يقول شكراً من غير تذكير حوالي 50 % من الوقت",
             "يجيب على الهاتف، ينادي الكبير أو يتحدث إلى شخص مألوف",
             "يستجيب لطلب الكبار 75 % من الوقت",
             "يجيب على أسئلة الكبار الموجهة له حول ألعابه أو اهتماماته",
             "يأخذ الأذن لاستعمال أدوات تخص الآخرين 75 % من الوقت"
            ],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد الاجتماعي الانفعالي (المهارات الانفعالية)",
                Quastions = [
                    "يناغي ويناجي عندما يكون مكتفياً باحتياجاته",
"يضحك",
"يمد يده للوصول إلى الأشياء المقدمة له",
"يمد يده للوصول إلى أشخاص مألوفين",
"يبتسم ويصدر أصوات لصورته في المرآة أو يمد يده ويصل إليها ليربت على صورته فيها",
"يحمل ويفحص الأشياء المقدمة لمدة دقيقة على الأقل",
"يكمل نشاطاته عند غياب أحد الوالدين ",
"يتنقل في البيئة المحيطة ليستكشفها بنشاط",
"يسحب شخص آخر لمشاهدة بعض الأشياء أو الأعمال",
"يسحب يده يقول لا عند الاقتراب بجوار أشياء ممنوعة عندما يذكر",
"ينتظر لأن تقضى له احتياجاته المرحاضية عندما يكون موضوعاً على كرسي عالي أو طاولة التغيير",
"يستمع إلى الموسيقى أو القصص لمدة من 5  - 10 دقائق",
"يختارعندما يسأل أتريد شرب اللبن أم العصير",
"يفهم المشاعر بتعبيره عن الحب ، الغضب ، الحزن ، الضحك   .... الخ",
"يرقص ويغني مع الإيقاع",
"يبقى في مكان محدد عندما يطلب منه ذلك",
"يطلب المساعدة عند ملاقاة صعوبة ( في الحمام ، أو إحضار شراب )",
"يعمل وحده في مهمة لمدة 20  - 30 دقيقة",
"يعتذر بدون تذكير 75% من الوقت",
"يتصرف بشكل مناسب عند تواجده في المحيط العام",
"يخبر عن مشاعره الخاصة ( غاضب ، مبسوط ، محب )",
"يخفف حال أصدقاء اللعب إن كانوا مضطربين",
"يختار أصدقاءه",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد الاجتماعي الانفعالي (اللعب  والتفاعل مع الألعاب)",
                Quastions = [
                    "يلعب لمدة 10 دقائق في مكان آمن وبمراقبة شخص كبير",
"يتحكم باللعب والأدوات مستخدماً يديه",
"يقلد حركات طفل آخر",
"يلعب بجانب طفل آخر لكن كل منهما يؤدي نشاط مختلف",
"يأخذ دور في لعبة دفع سيارة أو دحرجة كرة مع شخص كبير لمدة من 2-5 دقائق",
"يحضن ويحمل لعبة لينة أو عروسة ",
"يعيد الحركات التي تصدر ضحكاً وانتباهاً",
"يلعب لعبة ارتداء ملابس الكبار وتقليدهم",
"يلعب متبعاً القوانين في ألعاب جماعية مقادة من قبل شخص كبير",
"يلعب قرب أو يتحدث مع الأطفال الآخرين عندما يعمل بمشروعه الخاص لمدة 30 دقيقة",
"ينتظر دوره في اللعب مع 8 أو 9 أطفال آخرين",
"يلعب مع طفلين أو ثلاث لمدة 20 دقيقة في نشاط متعاون",
"يشرح قوانين الألعاب أو النشاطات للآخرين",
"يقلد دور الكبار",
"يمثل دور في قصة / مسرحية أو يستعمل اللعب التي تلبس باليد لذلك",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد المعرفي (المهارات الحسية والإدراكية)",
                Quastions = [
                    "الاستشارة البصرية العامة ( أقل من ستة أسابيع): مثل/ الاستجابة للضوء",
"الاستشارة اللمسية العامة ( أقل من ستة أسابيع): مثل/ الاستجابة للمثيرات اللمسية الصوفية",
"الاستشارة السمعية العامة ( أقل من ستة أسابيع): مثل/ الاستجابة للصوت العالي",
"الاستشارة البصرية العامة ( أكثر من ستة أسابيع): مثل/ الاستجابة لجسم متحرك",
"الاستشارة اللمسية العامة ( أكثر من ستة أسابيع): مثل/ الاستجابة للمثيرات اللمسية الناعمة",
"الاستشارة السمعية العامة ( أكثر من ستة أسابيع): مثل/ الاستجابة للصوت المنخفض",
"يهدأ أو يبكي أو يحرك جسمه كحساسية للتلامس الجسدي",
"ينظر بدقة إلى أداة تحركت عبر خط منتصف الجسم",
"يدير عينيه ورأسه باتجاه الضوء ",
"يدير رأسه باتجاه الصوت",
"ينظر إلى يده مدركاً إياها",
"يتواصل بصرياً لمدة 3 ثواني",
"يحرك عينيه لمتابعة أداة تتحرك أمامه لمساحة تقدر بـ 180 درجة",
"يخرج 6 أدوات من وعاء كل على حدى",
"يشير إلى جزء واحد من الجسم",
"يكدس 3 مكعبات فوق بعض عند الطلب",
"يطابق أدوات متشابهة",
"يشير إلى نفسه عندما يسأل ( أين اسمه)",
"يضع 5 أوتاد مدورة في لوح الأوتاد عند الطلب",
"يطابق أدوات مع صور لتلك الأدوات",
"يشير إلى صورة مسماة",
"يقلب من 2-3 صفحات من كتاب في المرة الواحدة ليجد الصورة المسماة",
"يركب 3 قطع في لوح أشكال",
"يسمي 4 صور مألوفة",
"يطابق بين 3 ملامس ( ناعم، خشن، طري)",
"يشير إلى كبير وصغير عند الطلب",
"يطابق ثلاثة ألوان",
"يضع الأدوات بداخل، على وتحت عند الطلب",
"يسمي أدوات تصدر أصواتاً",
"يطابق أشكال هندسية مع صور لتلك الأشكال",
"يكدس خمس أو أكثر من حلقات على وتد بالترتيب",
"يسمي الأدوات الصغيرة والكبيرة",
"يشير إلى 10 أجزاء من الجسم عند تلقي التعليمات اللغوية",
"يشير إلى ولد وبنت عند الأمر اللغوي",
"يخبر إما الأداة ثقيلة أم خفيفة",
"يلعب باليد والأصابع وهو يغني ويعمل حركات",
"يشير إلى الأدوات القصيرة والطويلة",
"يبني جسرا بـ 3 مكعبات بالتقليد",
"يسمي 3 ألوان عند الطلب",
"يسمي خمسة ملامس",
"يسمي 4 أشياء رآها في صورة",
"يقول إذا كان الشيء أثقل أو أخف ( أقل من نصف كيلو)",
"يسمي 8 ألوان",
"يسمي 5 ليرات، 10 ليرات، 25 ليرة",
"يقول لون الأدوات المسماة",
"يبني هرماً مكوناً من 10 مكعبات بالتقليد",
"يسمي طويل وقصير",
"يضع الأدوات بالخلف، بجانب، بالقرب من ",
"يسمي الموضع إما الأول، الوسط، الأخير",
"يسمي اليمين واليسار على نفسه",
"يرتب الأدوات تبعاً للطول والعرض",
"يسمي موضع الأدوات إما الأول، الثاني، الثالث",
"يسمي أيام الأسبوع",
"يشير إلى نصف وكل الأشياء",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد المعرفي (الاستكشاف والتفكير المنطقي والأهداف الرياضية)",
                Quastions = [
                    "يدير رأسه باحثاً عن مصدر الصوت",
"يرفع قطعة من القماش من على وجهه (تعرقل الرؤية)",
"يبحث ببصره عن أداة رفعت من خط الرؤيته المباشر",
"يضع أداةً في يده مستكشفاً إياها",
"يجد أداة مخبأة تحت وعاء",
"يركب أحجية من قطعتين",
"يطابق مجموعات متساوية من  1-3 أشياء",
"يقول أي الأدوات تتناسب معاً",
"يعد إلى عشرة آلياً مقلداً",
"يرتب الأدوات في فصائل",
"يعد إلى عشرة مع مفهوم العدد مقلداً",
"يطابق سلسلة أو نموذج من المكعبات أو الخرز",
"يكمل صورة مجزأة من 6 قطع دون خطأ",
"يخبر إذا ما كانت الأشياء متشابهه أم مختلفة",
"يسمي 3 أشكال هندسية",
"يلتقط عدد محدد من الأدوات (1 – 5) عند الطلب",
"يسمي الوقت من النهار المربوط بنشاطات",
"يقول بما هو ناقص عندما تزال أداة من مجموعة مكونة من 3 أدوات",
"يطابق مجموعات متساوية من 1 – 10 أشياء",
"يسمي أو يشير إلى الجزء الناقص من الصورة",
"يعد عداً آلياً من 1 – 20",
"يعد إلى 20 مع مفهوم العدد",
"يسمي 10 أعداد مكتوبة",
"يرتب الأعداد المكتوبة من 1 إلى 10 في التسلسل الصحيح",
"يشير إلى الأعداد المكتوبة من 1-25",
"يكمل متاهات بسيطة",
"يجمع ويطرح مركبات إلى ثلاثة",
"يقول يوم وشهر ميلاده",
"يخبر عن توقعاته لما سيحدث",
"يعد من الذاكرة عداً آلياً من 1 – 100",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد الاتصالي (التواصل واللغة)",
                Quastions = [
                    "يبكي بطريقة مختلفة طبقاً لنوع الإزعاجات",
"يعيد صوته الشخصي",
"يتحدث بكلام غير مفهوم (سلسلة من المقاطع)",
"يعيد الصوت الصادر من الآخرين",
"يعيد نفس المقطع مرتين أو ثلاث مثل (ما-ما-ما)",
"يجيب على الإشارات بإشارات",
"ينفذ بعض التعليمات البسيطة التي تكون مصحوبة بإشارات",
"يوقف النشاط لمدة دقائق عندما يقال له (لا) 75% من الوقت",
"يجيب أسئلة بسيطة بإجابة غير لغوية",
"يتحدث رابطاً مقطعين مختلفين خلال اللعب اللغوي",
"يسمي شيء أو شخص باستعمال كلمة مفردة",
"يقول 5 كلمات مختلفة (ممكن استعمال نفس الكلمة  للرمز لأشياء مختلفة)",
"يطلب المزيد (كمان)",
"يقول انتهى / اختفى (بح)",
"ينفذ 3 تعليمات مختلفة لخطوة واحدة بدون استعمال الإشارات",
"(يعطي), أو (يري) عند الطلب منه",
"يشير إلى 12 شيء مألوف عندما تذكر",
"يقول اسمه واسم الدلم عندما يطلب منه",
"يجيب سؤال ما هذا الشيء؟ بإعطاء اسم ذلك الشيء",
"يتحدث رابطاً استعمال الكلمات والإشارات ليجعل رغباته معروفة",
"يسمي 5 أشخاص آخرين من العائلة",
"يسمي 4 ألعاب",
"يقلد أصوات حيوانات أو يستعمل أصوات الحيوانات كأسماء لها مثل (الكلب هاو هاو)",
"يسأل عن بعض الطعام المألوف عندما يراه مثل لبن, بسكويت, حلوى",
"يسأل أسئلة وبذلك يقول الجملة أو الكلمة على صيغة سؤال",
"يشير إلى 3 أجزاء من جسمه",
"يجيب أسئلة نعم أو لا بإجابة مثبتة أو منفية",
"يعبر عن الملكية بجملة من كلمتين أو بكلمة واحدة (مثال: كرة.., كرتي)",
"يربط إسم فعل في مقطع مكون من كلمتين (بابا راح)",
"يستعمل الكلمة التي تعني احتياج الذهاب إلى الحمام",
"يتحدث رابطاً الاسم أو الفعل مع (هنا, هناك) في جملة قصيرة من كلمتين مثل (هنا كرسي)",
"يقول لا يوجد أو ليس في الكلام (فش, مافي, مش هيك بالعامية)",
"يجيب سؤال ماذا يفعل؟ خلال نشاطاته العادية له وللأسرة",
"يجيب أسئلة مثل: أين أمك؟",
"يسمي أصوات مألوفة من البيئة مثل صوت القطة",
"يعطي أكثر من شيء واحد عند سؤاله باستعمال صيغة الجمع مثل (مكعبات)",
"يدل على نفسه باستعمال اسمه في الحديث",
"يشير إلى صور لأشياء مألوفة موصوفة باستعمالها(10)",
"يرفع أصابعه ليقول عمره",
"يجيب عندما يسأل عن الجنس (بنت أم ولد)",
"ينفذ سلسلة من أمرين متقاربين (خذ الكرسي وضعه في الزاوية)",
"يستعمل الفعل المضارع بطريقة صحيحة",
"يستعمل صيغة الجمع (كتاب – كتب)",
"يستعمل بعض الأفعال الماضية (ذهب, عمل, كان)",
"يسأل سؤال ما هذا....... ذاك؟",
"يتحكم بارتفاع الصوت 90% من الوقت",
"يستعمل هذا وتلك في الحديث",
"يستعمل كلمة هذه في جملة مثل: هذه كرة.",
"يقول أنا بدل اسمه",
"يشير إلى أشياء ليست الشيء(ليس المكعب)",
"يجيب أسئلة من باسم",
"يستعمل صيغة الملكية من الاسم (لبابا)",
"يستعمل أل التعريف أو النكرة في الحديث (الكرة, كرة)",
"يستعمل بعض أسماء من المجموعات (اللعب الحيوانات الطعام)",
"يقول أستطيع أو أقدر قبل الفعل أحياناً (أقدر أعمل)",
"يصنف الأشياء إما مفتوحة أو مغلقة",
"ينفذ سلسلة من أمرين غير متقاربين (مثال: خذ الكوب وأطفئ الضوء)",
"يقول الاسم كاملاً عندما يطلب منه",
"يجيب أسئلة بسيطة تبدأ بكيف مثل (كيف تصل إلى البقال)",
"يستعمل صيغة الماضي",
"يخبر عن التجربة الفورية",
"يخبر عن كيفية استعمال أدوات معروفة",
"يستعمل (سوف, سوف أذهب, سوف أعمل, أريد أن) للتعبير عن الأشياء المقبلة",
"يسأل سؤالاً استفهامياً بطريقته الخاصة",
"يقول بعض صيغ الجمع الشائعة (رجال, أقدام) بشكل مناسب",
"يخبر عن حدثين في نفس ترتيب حدوثهما",
"ينفذ سلسلة من 3 إشارات",
"يخبر عن فهمه للجملة المبنية للمجهول (الولد أكل التفاحة: أكلت التفاحة)",
"يجد زوج من الأدوات, الصور عند الطلب",
"يقول (أستطيع, أرغب) في الكلام بشكل مناسب",
"يقول جمل مترابطة (أنا ضربت الكرة وطارت إلى الشارع)",
"يجد أعلى وأسفل الأشياء عند الطلب",
"يقول جمل منفية: لا أريد, لا أستطيع, لن أفعل. ",
"يشير إلى الأخطاء السخيفة في الصورة",
"يقول كلمات أخ, أخت, جد, جدة, بشكل مناسب",
"يقول الكلمة النهائية في التناظر العكسي (مثال: تظهر الشمس في الصباح, ويظهر القمر في.....)",
"يسمي الصورة التي لا تنتمي إلى فئة معينة (لا تنتمي إلى فئة الحيوان)",
"يقول إن كانت الكلمتين على نفس الوزن والنغمة أم لا",
"يخبر إذا كان الصوت عالياً أو خافتاً",
"يشير إلى قليل, أكثر, أكثر الجميع",
"يقول العنوان",
"يقول رقم الهاتف",
"يقول نكت بسيطة",
"يخبر عن تجاربه اليومية",
"يصف طريق الوصول من باب منزله إلى غرفته",
"يجيب أسئلة لماذا بتفسير",
"يقول معاني الكلمات",
"يقول عكس الشيء",
"يجيب أسئلة ماذا يحدث إذا: مثال/ ماذا يحدث إذا سقطت البيضة؟",
"يتحدث مستعملاً كلمة أمس, وغداً بطريقة سليمة",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "المجال الاتصالي (مهارات القراءة المبكرة)",
                Quastions = [
                    "يقلب صفحات من كتاب في وقت واحد",
"يشير إلى 3-5 صور في كتاب عندما تذكر أسماؤهم",
"يعطي كتاب لشخص كبير للقراءة له أو المشاركة معه بالنظر",
"يحضر كتاب معين عند الطلب",
"يصف 3 أنشطة ممثلة في صور",
"يصف حدثين أو شخصيتين من قصة مألوفة أو برنامج على TV",
"يجلس ليستمع 5 دقائق عندما تقرأ له قصة",
"يطابق الرمز (الأحرف والأعداد المكتوبة)",
"يقول خمسة أحداث رئيسية من قصة سمعها 3 مرات",
"يغني 5 أسطر من أغنية",
"يسرد قصة مألوفة دون استخدام صور للتلميحات",
"يسرد الأحرف الأبجدية غيباً وبالترتيب",
"يسمي خمسة أحرف أبجدية",
"يقرأ الأحرف الأبجدية بالترتيب",
"يطابق الأحرف في بداية الكلمة وفي وسطها, بالإضافة إلى الأحرف المنفصلة",
"يقرأ الأحرف في بداية الكلمة وفي وسطها, بالإضافة إلى الأحرف المنفصلة",
"يقرأ عشر كلمات مطبوعة دون أن يتهجى الكلمة",
"يضع من 3-5 أجزاء متسلسلة من قصة ويقولها معاً",
"العناية الذاتية (التغذية)",
"يرضع",
"يفتح الفم لتلقي زجاجة الرضاعة أو الصدر عند ملامسة الحلمة للفم",
"يفتح الفم عندما يشاهد ملعقة عليها طعام",
"يأكل طعام ممزوج بسوائل يطعمه إياه أحد الوالدين مثل السيريلاك أو بسكويت ممزوج بالحليب",
"يحمل زجاجة الرضاعة أو يمسك الثدي عند الرضاعة بدون أي مساعدة",
"يأكل طعام مهروس يطعم بواسطة أحد الوالدين",
"يشرب من كوب يحمله أحد الوالدين",
"يأكل طعام شبه جامد يطعمه إياه أحد الوالدين مثل( موز, بسكويت, عيش)",
"يطعم نفسه بأصابعه",
"يحمل ويشرب من فنجان باستعمال كلتا يديه",
"يصب ماء دون مساعدة عند توفر كرسي أو درجات خشبية له",
"يصب من إبريق صغير في كوب دون مساعدة",
"يأكل الوجبة كلها بنفسه بحسب عادات الأسرة (دون مساعدة)",
"يدهن طعام لين (زبده, حمص, مربى) على قطعة من الخبز",
"يسكب لنفسه الطعام بينما يحمل أحد الوالدين الطبق المحتوي على الطعام",
"يسكب الطعام بطبقه من طبق السكب ثم يمرر طبق السكب للآخرين",
"يحضر وجبته الخاصة من الحبوب (مثال: وجبة الحبوب مع السوائل- الكعك مع الحليب)",
"يحضر شطيرة (ساندويتش لنفسه)",
"يقطع طعام بسكين آمن (مثال: موز – بطاطس مسلوقة- بيض)",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "العناية الذاتية (النظافة)",
                Quastions = [
                    "يجلس على القصرية (النونية) أو على مقعد المرحاض الخاص بالأطفال لمدة 5 دقائق",
"يقول كلمات أو يشير إلى احتياجه للذهاب إلى المرحاض",
"يمضغ ويبلع المواد الصالحة للأكل فقط",
"يمسح يديه ووجهه بالمنشفة بعد أن يأخذها من أحد الوالدين",
"يذهب إلى المرحاض بعد حركة الأمعاء, حادث واحد خلال النهار/خلال أسبوع مسموح",
"يغسل يده ووجهه مستعملاً الصابون عندما يوازن له شخص كبير درجة حرارة الماء",
"يعلق البالطو على علاقة بطوله",
"ينام دون أن يبلل نفسه (خلال النوم القصير)",
"ينظف فمه عند الحاجة أثناء تناول الطعام",
"يغسل يديه ورجليه بنفسه عندما يحمم",
"يمسح أنفه عندما يذكر",
"يبتعد عن الأخطار العادية (الزجاج المكسور)",
"يستيقظ ليلاً لاستعمال المرحاض أو يبقى جافاً طوال الليل",
"ينظف ما سكب بجلب ممسحة أو إسفنج",
"يبتعد عن السموم والمواد الضارة كمواد التنظيف",
"ينقل أدواته عن المائدة بعد تناول الطعام",
"يغسل اليدين والوجه",
"ينظف (يمخط الأنف) 75% من الوقت عندما يحتاج دون تذكير",
"يغتسل (يستحم) بنفسه عدا الظهر, الرقبة, الأذنين",
"يساعد والدته في إعداد سفرة الطعام بالطريقة التي تتناسب مع عادات الأسرة في تناول الطعام (بعد إعطائه التعليمات اللغوية)",
"ينظف أسنانه",
"يذهب للمرحاض في الميعاد, يخلع ملابسه, يمسح, يفتح السيفون, ويلبس دون أي مساعدة",
"ينفذ مهمة أسبوعية واحدة عند الطلب (مسئول عنها كلياً)",
"ينفذ مهمة منزلية يومية مسئول عنها(تحضير المائدة, إلقاء القمامة)",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "العناية الذاتية (ارتداء الملابس)\r\n",
                Quastions = [
                    "يخلع الجوارب",
"يمد الذراعين داخل كم القميص والرجلين داخل البنطلون",
"يخلع الحذاء عندما يكون الرباط غير مربوط أو مرخي",
"يخلع الجاكيت عندما يكون مفكوكاً",
"يخلع البنطلون عندما يكون مفكوكاً",
"يقفل أو يفتح سحاب كبير ولكن لا يركب طرفيه",
"يلبس حذائه (دون ربط الرباط)",
"يخلع ملابسه السهلة الخلع بعد فكها",
"يفك كبسونة الملابس ",
"يلبس جواربه",
"يلبس قميصه, جاكيته, أو البالطو الخاص به",
"يقلب الملابس على وجهها",
"يلبس بنفسه مع مساعدة عند لبس ما يحتاج لتزرير",
"يقفل كبسونات الملابس",
"يعلق البالطو على علاقة وضعت على قضيب منخفض مع إعطاءه التعليمات",
"يفك ويزرر ملابسه",
"يركب طرفي السحاب معاً",
"يربط ويفك الحزام ذو إبزيم من على فستان, بنطلون, أو حذاء",
"يلبس بنفسه كلياً إضافةً إلى تزرير كل الأزرار الأمامية عدا الربط",
"يعلق الملابس على العلاقة ",
"يربط حذاءة ",
"يختار ملابس مناسبة لدرجة الحرارة والمناسبات",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد الحركي (المهارات الحركية الكبيرة )",
                Quastions = [
                    "يحرك الرأس إلى الجانب بينما يكون مستلقياً على ظهره ",
"يرفع رأسه من على الكتف ويحافظ على وضعه للحظات بينما يكون الطفل محمولاً ورأسه على كتف من يحمله ",
"يحرك الذراعين حوله بدون اتجاه معين ",
"يرفس بعنف عندما يكون مستلقياً على ظهره",
"يرفع رأسه ويحافظ على وضعه لمدة 5ثوان بينما يكون الطفل على بطنه",
"يجلس متحكماً بالرأس والكتفين وهو مسنود بوسادة ",
"يرفع رأسه بثبات عندما يكون محمولاً  بوضع عامودي ",
"يتدحرج باستعمال الكتفين ",
"يستلقي على بطنه مسنداً رأسه وصدره على ذراعيه ",
"يقلب وهو مستلق على بطنه إلى جانبه ومن ثم إلى بطنه ",
"يحرك رأسه بحرية وجسمه مسنودا ",
"يقلب وهو مستلق على ظهره إلى جانبه ومن ثم إلى بطنه ",
"يهز نفسه إلى أعلى وأسفل في وضع الوقوف مسنوداً",
"يزحف بقدر طول جسمه ليحصل على الأداة ",
"يجلس دون إسناد",
"يتأرجح إلى الخلف والأمام على يديه وركبتيه ",
"يسحب نفسه إلى وضع على ركبتيه ",
"يسحب نفسه إلى وضع الوقوف",
"يقف لوحده لمدة دقيقة",
"يخفض نفسه ليتخذ وضع الجلوس بعد أن كان واقفاً ",
"يخطوا بضعة خطوات دون مساندة ",
"يزحف إلى أعلى الدرج ",
"يتسلق على كرسي الكبار ،يدير نفسه ويجلس",
"يمشي لوحده بدون مساعدة ",
"يجلس بنفسه على كرسي صغير",
"يقرفص ثم ينهض",
"يدفع ويسحب اللعب وهو يمشي ",
"ينحني من الوسط ليلتقط الأدوات دون أن يقع",
"يقفز في مكانه بكلتا قدميه",
"يمشي للخلف",
"يرمي كرة إلى شخص كبير على بعد متر ونصف دون أن يحرك هذا الشخص قدميه",
"يرمي كرة كبيرة وثابتة بقدمه ",
"يصعد وينزل الدرج بتبادل القدمين عندما يستعين بالدرابزين أو يساعده أحد ",
"يتشقلب إلى الأمام بمساعدة",
"يقفز من ارتفاع 20سم",
"يضرب بقدمه كرة كبيرة مدحرجة إليه",
"يتأرجح على أرجوحة بعد أن يدفعه أحد في البداية",
"يتشقلب إلى الأمام",
"يمسك كرة مقذوفه إليه بكلتا يديه",
"يقف على قدم واحدة لمدة من 4-8ثوان دون مساعدة ",
"يجري مغيراً اتجاهه ",
"يمشي على خشبة التوازن",
"يقفز إلى الأمام 10مرات دون أن يقع (2-3)توازن",
"يقفز عن حبل يرتفع 5سم عن الأرض",
"يضرب كرة كبيرة على الأرض ويلتقطها ",
"يتسلق سلم انزلاق ارتفاعه 2م لينزلق من أعلى زلاقة (سحسلية )",
"يمسك كرة لينة أو كيس فاصوليا بيد واحدة (بعد أن يكون شخص قد رماه باتجاهه)",
"يلتقط أداة من الأرض وهو يجري",
"يقفز ثم يدور على قدم واحدة",
"يقف على قدم واحدة دون مساندة وعينيه مغلقتين لمدة 10ثوان",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد الحركي (المهارات الحركية الدقيقة)\r\n",
                Quastions = [
                    "يضرب بعنف على أداة",
"يمد يده نحو الأشياء محولا الإمساك بها ",
"يمسك الطفل أدوات باستعمال الكف لمدة 30  ثانية ويسقطها بدون قصد ",
"يمد يده ويمسك أداة أمامه ",
"يترك الأدوات التي في يده عن قصد ليمد يده إلى أداة أخرى ",
"يلتقط ويسقط أدوات عن قصد ",
"يرمي الأدوات بصورة اعتباطية ",
"ينقل أداة من يد إلى اليد الأخرى وهو في وضع الجلوس ",
"يحتفظ بمكعبين حجم كل منهم 2.5سم 3بيد واحدة ",
"يمسك بأداة بالسبابة والإبهام على طريقة الكماشة ",
"يتحكم باللعاب السائل ",
" يلحس الطعام من حول فمه",
"يغرف بالملعقة أو المغرفة ",
"يصفق بكلتا يديه",
"يدحدر كرة بالتقليد ",
"يضع أربع خرزات كبيرة في خيط خلال دقيقتين ",
"يدير يد الباب ",
"يقلب صفحات من كتاب صفحة صفحة ",
"يفك أداة صغيرة ملفوفة ",
"يطوي ورقة من النصف بالتقليد ",
"يفك لعبا ذات أسنان ",
"يشكل كرات من الصلصال ( المعجون ) ",
"يدق بالشاكوش ( المطرقة) ويصيب 5 أوتاد ",
"يقص بالمقص",
"يتبع هيكل الشكل",
"يقص خط مستقيم طوله12 سم دون أن ينحرف عنه أكثر من 1 سم ",
"يشكل قطعتين أو ثلاث من الطين ويركبها معا ",
"يقص على خط منحني",
"يركب أداة ذات أسنان ",
"يقص دائرة قطرها 5 سم ",
"يرسم صورا بسيطة من الممكن التعرف عليها مثل( بيت ، رجل شجرة )",
"يقص ويلصق أشكال بسيطة ",
"يلمس بإبهامه كل أصبع بعد فردها ",
"يقص صورة من مجلة ،كتالوج ، بدون أن ينحرف عن طرف الصورة أكثر     من 1 سم",
"يبري قلم الرصاص بالمبراة ",
"يمزق أشكال بسيطة من ورقة",
"يثني مربع من ورق مرتين على القطر بالتقليد ",

],
            });
            testPortageIndividualPlanVMs.Add(new TestPortageIndividualPlanVM()
            {
                TitleGroup = "البعد الحركي (مهارات ما قبل الكتابة )",
                Quastions = [
                    "يحرك الإبهام مقابل الأصابع الأربعة الأخرى ",
"يخربش ",
"يرسم خطا عموديا مقلدا",
"يرسم خطا أفقيا مقلدا",
"يرسم دائرة مقلدا ",
"يمسك القلم بالسبابة والإبهام مستندا على الإصبع الوسطى ",
"يرسم علامة (+) مقلدا ",
"يرسم شكل 7 مقلدا ",
"يرسم خط قطري من زاوية مربع إلى الزاوية الأخرى ",
"يرسم مربعا بالتقليد",
"ينسخ مثلث عند الطلب ",
"يرسم رجل (رأس ، وسط ، أربعة أطراف)",
"يلون مع بقائه داخل الخطوط 95% من الوقت",
"يكتب اسمه الأول ",
"يرسم المعين مقلدا ",

],
            });

            return View(testPortageIndividualPlanVMs);
        }

        #endregion

        #region StanfordBinet
        public async Task<IActionResult> AddTestStanfordBinet(int studentId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            Student student = await studentService.GetStudent(studentId);

            return View(student);
        }

        [HttpPost]
        public async Task<IActionResult> AddTestStanfordBinet(TestStanfordBinet testStanfordBinet)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            int testId = await testService.AddTestStanfordBinet(testStanfordBinet);
            return RedirectToAction("GetTestStanfordBinetReport", new { testId = testId });
        }
        //جلب تقرير الاختبار الواحد
        public async Task<IActionResult> GetTestStanfordBinetReport(int testId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");
            TestStanfordBinet getTest = await testService.GetTestStanfordBinetById(testId);
            return View(getTest);
        }

        public async Task<IActionResult> GetTestStanfordBinet(int studentId)
        {
            if (!HttpContext.HasSession())
                return RedirectToAction("Index", "Home");

            List<TestStanfordBinetDetails> getTest = await testService.GetStudentTestStanfordBinet(studentId);
            return View(getTest);
        }

        #endregion

    }
}
